<template>
    <div class="container" id="container">
        <div>
            <div>
                <div class="Header_header__wrapper__5r0kF">
                    <div class="Header_country__back__Ogf+S"><button class="Header_country__back__btn__kQyXX"><svg
                                width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M11.5 2C12.163 2 12.7989 2.26339 13.2678 2.73223C13.7366 3.20107 14 3.83696 14 4.5V6.257C13.0156 5.44269 11.7775 4.99806 10.5 5H13V4.5C13 4.10218 12.842 3.72064 12.5607 3.43934C12.2794 3.15804 11.8978 3 11.5 3H4.5C4.10218 3 3.72064 3.15804 3.43934 3.43934C3.15804 3.72064 3 4.10218 3 4.5V5H10.5C9.323 5 8.232 5.37 7.337 6H3V11.5C3 11.8978 3.15804 12.2794 3.43934 12.5607C3.72064 12.842 4.10218 13 4.5 13H5.6C5.783 13.358 6.004 13.693 6.257 14H4.5C3.83696 14 3.20107 13.7366 2.73223 13.2678C2.26339 12.7989 2 12.163 2 11.5V4.5C2 3.83696 2.26339 3.20107 2.73223 2.73223C3.20107 2.26339 3.83696 2 4.5 2H11.5ZM15 10.5C15 11.0909 14.8836 11.6761 14.6575 12.2221C14.4313 12.768 14.0998 13.2641 13.682 13.682C13.2641 14.0998 12.768 14.4313 12.2221 14.6575C11.6761 14.8836 11.0909 15 10.5 15C9.90905 15 9.32389 14.8836 8.77792 14.6575C8.23196 14.4313 7.73588 14.0998 7.31802 13.682C6.90016 13.2641 6.56869 12.768 6.34254 12.2221C6.1164 11.6761 6 11.0909 6 10.5C6 9.30653 6.47411 8.16193 7.31802 7.31802C8.16193 6.47411 9.30653 6 10.5 6C11.6935 6 12.8381 6.47411 13.682 7.31802C14.5259 8.16193 15 9.30653 15 10.5ZM12.354 9.354C12.4005 9.30751 12.4374 9.25232 12.4625 9.19158C12.4877 9.13084 12.5006 9.06574 12.5006 9C12.5006 8.93426 12.4877 8.86916 12.4625 8.80842C12.4374 8.74768 12.4005 8.69249 12.354 8.646C12.3075 8.59951 12.2523 8.56264 12.1916 8.53748C12.1308 8.51232 12.0657 8.49937 12 8.49937C11.9343 8.49937 11.8692 8.51232 11.8084 8.53748C11.7477 8.56264 11.6925 8.59951 11.646 8.646L10.5 9.793L9.354 8.646C9.26011 8.55211 9.13278 8.49937 9 8.49937C8.86722 8.49937 8.73989 8.55211 8.646 8.646C8.55211 8.73989 8.49937 8.86722 8.49937 9C8.49937 9.13278 8.55211 9.26011 8.646 9.354L9.793 10.5L8.646 11.646C8.55211 11.7399 8.49937 11.8672 8.49937 12C8.49937 12.1328 8.55211 12.2601 8.646 12.354C8.73989 12.4479 8.86722 12.5006 9 12.5006C9.13278 12.5006 9.26011 12.4479 9.354 12.354L10.5 11.207L11.646 12.354C11.7399 12.4479 11.8672 12.5006 12 12.5006C12.1328 12.5006 12.2601 12.4479 12.354 12.354C12.4479 12.2601 12.5006 12.1328 12.5006 12C12.5006 11.8672 12.4479 11.7399 12.354 11.646L11.207 10.5L12.354 9.354Z"
                                    fill="url(#paint0_linear_175_5190)"></path>
                                <defs>
                                    <linearGradient id="paint0_linear_175_5190" x1="2" y1="2" x2="15.9963" y2="3.17971"
                                        gradientUnits="userSpaceOnUse">
                                        <stop stop-color="#FF6DBB"></stop>
                                        <stop offset="1" stop-color="#EE4498"></stop>
                                    </linearGradient>
                                </defs>
                            </svg>Отменить</button></div>
                    <div class="Header_country__tab__nd8Jh">Обмен <svg width="20" height="20" viewBox="0 0 20 20"
                            fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M9.41655 11.9166L7.24989 9.74992C6.986 9.48603 6.92711 9.18409 7.07322 8.84409C7.21878 8.50353 7.47905 8.33325 7.85405 8.33325H12.1457C12.5207 8.33325 12.781 8.50353 12.9266 8.84409C13.0727 9.18409 13.0138 9.48603 12.7499 9.74992L10.5832 11.9166C10.4999 11.9999 10.4096 12.0624 10.3124 12.1041C10.2152 12.1458 10.111 12.1666 9.99989 12.1666C9.88878 12.1666 9.78461 12.1458 9.68739 12.1041C9.59017 12.0624 9.49989 11.9999 9.41655 11.9166Z"
                                fill="white"></path>
                        </svg></div>
                    <div class="Header_country__nHXWK "><svg width="16" height="16" viewBox="0 0 16 16" fill="none"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M11.7712 11.1047L8.94251 13.9334C8.8188 14.0572 8.6719 14.1554 8.51021 14.2225C8.34852 14.2895 8.17521 14.324 8.00017 14.324C7.82514 14.324 7.65183 14.2895 7.49013 14.2225C7.32844 14.1554 7.18154 14.0572 7.05784 13.9334L4.22851 11.1047C3.48265 10.3588 2.97473 9.40852 2.76896 8.37396C2.5632 7.3394 2.66883 6.26706 3.07251 5.29254C3.47618 4.31801 4.15977 3.48508 5.03683 2.89905C5.91388 2.31303 6.94502 2.00024 7.99984 2.00024C9.05466 2.00024 10.0858 2.31303 10.9629 2.89905C11.8399 3.48508 12.5235 4.31801 12.9272 5.29254C13.3308 6.26706 13.4365 7.3394 13.2307 8.37396C13.0249 9.40852 12.517 10.3588 11.7712 11.1047V11.1047Z"
                                stroke="url(#paint0_linear_200_1217)" stroke-linecap="round" stroke-linejoin="round"></path>
                            <path
                                d="M9.41421 8.74747C9.78929 8.37239 10 7.86368 10 7.33325C10 6.80282 9.78929 6.29411 9.41421 5.91904C9.03914 5.54397 8.53043 5.33325 8 5.33325C7.46957 5.33325 6.96086 5.54397 6.58579 5.91904C6.21071 6.29411 6 6.80282 6 7.33325C6 7.86368 6.21071 8.37239 6.58579 8.74747C6.96086 9.12254 7.46957 9.33325 8 9.33325C8.53043 9.33325 9.03914 9.12254 9.41421 8.74747Z"
                                stroke="url(#paint1_linear_200_1217)" stroke-linecap="round" stroke-linejoin="round"></path>
                            <defs>
                                <linearGradient id="paint0_linear_200_1217" x1="2.6665" y1="2.00024" x2="14.494"
                                    y2="3.23876" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#7C6DD2"></stop>
                                    <stop offset="1" stop-color="#7C36D2"></stop>
                                </linearGradient>
                                <linearGradient id="paint1_linear_200_1217" x1="6" y1="5.33325" x2="10.4192" y2="5.86791"
                                    gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#7C6DD2"></stop>
                                    <stop offset="1" stop-color="#7C36D2"></stop>
                                </linearGradient>
                            </defs>
                        </svg><img src="https://api-app.yeloo.org/files/static/th.png" alt="flag"
                            class="sc-dcntqk hjcobA">TH</div>
                </div>
                <div class="Header_header__line__aozMJ"></div>
            </div>
            <div>
                <div>
                    <div class="Exchange_exchange__header__row__QDAEe">
                        <h3>Обмен</h3>
                        <div class="Exchange_exchange__header__row__data__emKsz">3&nbsp;333 RUB<svg width="20" height="20"
                                viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M18.2667 9.68324C18.2271 9.58095 18.1676 9.4875 18.0917 9.40824L16.0084 7.32491C15.8515 7.16799 15.6387 7.07983 15.4167 7.07983C15.1948 7.07983 14.982 7.16799 14.8251 7.32491C14.6682 7.48183 14.58 7.69466 14.58 7.91658C14.58 8.13849 14.6682 8.35132 14.8251 8.50824L15.4917 9.16658H11.6667C11.4457 9.16658 11.2338 9.25437 11.0775 9.41065C10.9212 9.56693 10.8334 9.7789 10.8334 9.99991C10.8334 10.2209 10.9212 10.4329 11.0775 10.5892C11.2338 10.7454 11.4457 10.8332 11.6667 10.8332H15.4917L14.8251 11.4916C14.747 11.569 14.685 11.6612 14.6427 11.7628C14.6004 11.8643 14.5786 11.9732 14.5786 12.0832C14.5786 12.1933 14.6004 12.3022 14.6427 12.4037C14.685 12.5053 14.747 12.5974 14.8251 12.6749C14.9025 12.753 14.9947 12.815 15.0963 12.8573C15.1978 12.8996 15.3067 12.9214 15.4167 12.9214C15.5268 12.9214 15.6357 12.8996 15.7372 12.8573C15.8388 12.815 15.9309 12.753 16.0084 12.6749L18.0917 10.5916C18.1676 10.5123 18.2271 10.4189 18.2667 10.3166C18.3501 10.1137 18.3501 9.88613 18.2667 9.68324ZM8.33341 9.16658H4.50841L5.17508 8.50824C5.332 8.35132 5.42015 8.13849 5.42015 7.91658C5.42015 7.69466 5.332 7.48183 5.17508 7.32491C5.01816 7.16799 4.80533 7.07983 4.58341 7.07983C4.36149 7.07983 4.14866 7.16799 3.99174 7.32491L1.90841 9.40824C1.83254 9.4875 1.77307 9.58095 1.73341 9.68324C1.65006 9.88613 1.65006 10.1137 1.73341 10.3166C1.77307 10.4189 1.83254 10.5123 1.90841 10.5916L3.99174 12.6749C4.06921 12.753 4.16138 12.815 4.26293 12.8573C4.36448 12.8996 4.4734 12.9214 4.58341 12.9214C4.69342 12.9214 4.80234 12.8996 4.90389 12.8573C5.00544 12.815 5.09761 12.753 5.17508 12.6749C5.25318 12.5974 5.31518 12.5053 5.35749 12.4037C5.39979 12.3022 5.42158 12.1933 5.42158 12.0832C5.42158 11.9732 5.39979 11.8643 5.35749 11.7628C5.31518 11.6612 5.25318 11.569 5.17508 11.4916L4.50841 10.8332H8.33341C8.55442 10.8332 8.76639 10.7454 8.92267 10.5892C9.07895 10.4329 9.16674 10.2209 9.16674 9.99991C9.16674 9.7789 9.07895 9.56693 8.92267 9.41065C8.76639 9.25437 8.55442 9.16658 8.33341 9.16658Z"
                                    fill="#3BD8CC"></path>
                            </svg> THB</div>
                    </div>
                    <div class="Exchange_exchange__header__row__QDAEe">
                        <h3>Оплата:</h3>
                        <div class="Exchange_exchange__header__row__data__emKsz">
                            <div class="Circle_circle__3jS7D"
                                style="background: rgb(255, 255, 0); min-width: 9.6px; min-height: 9.6px; opacity: 1;">
                            </div>
                            <div class="Circle_circle__3jS7D"
                                style="background: rgb(0, 255, 0); min-width: 9.6px; min-height: 9.6px; opacity: 1;"></div>
                            <div class="Circle_circle__3jS7D"
                                style="background: rgb(232, 192, 49); min-width: 9.6px; min-height: 9.6px; opacity: 1;">
                            </div>
                            <p>Тинькофф</p><span data-tooltip-id="pay-methods-tooltip" data-tooltip-content="[11,14,15]"
                                class="sc-gXnjX iGlJQ"><svg width="16" height="16" viewBox="0 0 16 16" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <g opacity="0.4">
                                        <path
                                            d="M8.00016 11.3333C8.18905 11.3333 8.3475 11.2693 8.4755 11.1413C8.60305 11.0137 8.66683 10.8555 8.66683 10.6666V7.98325C8.66683 7.79436 8.60305 7.63881 8.4755 7.51658C8.3475 7.39436 8.18905 7.33325 8.00016 7.33325C7.81127 7.33325 7.65305 7.39703 7.5255 7.52458C7.3975 7.65258 7.3335 7.81103 7.3335 7.99992V10.6833C7.3335 10.8721 7.3975 11.0277 7.5255 11.1499C7.65305 11.2721 7.81127 11.3333 8.00016 11.3333ZM8.00016 5.99992C8.18905 5.99992 8.3475 5.93592 8.4755 5.80792C8.60305 5.68036 8.66683 5.52214 8.66683 5.33325C8.66683 5.14436 8.60305 4.98592 8.4755 4.85792C8.3475 4.73036 8.18905 4.66658 8.00016 4.66658C7.81127 4.66658 7.65305 4.73036 7.5255 4.85792C7.3975 4.98592 7.3335 5.14436 7.3335 5.33325C7.3335 5.52214 7.3975 5.68036 7.5255 5.80792C7.65305 5.93592 7.81127 5.99992 8.00016 5.99992ZM8.00016 14.6666C7.07794 14.6666 6.21127 14.4915 5.40016 14.1413C4.58905 13.7915 3.8835 13.3166 3.2835 12.7166C2.6835 12.1166 2.20861 11.411 1.85883 10.5999C1.50861 9.78881 1.3335 8.92214 1.3335 7.99992C1.3335 7.0777 1.50861 6.21103 1.85883 5.39992C2.20861 4.58881 2.6835 3.88325 3.2835 3.28325C3.8835 2.68325 4.58905 2.20814 5.40016 1.85792C6.21127 1.50814 7.07794 1.33325 8.00016 1.33325C8.92238 1.33325 9.78905 1.50814 10.6002 1.85792C11.4113 2.20814 12.1168 2.68325 12.7168 3.28325C13.3168 3.88325 13.7917 4.58881 14.1415 5.39992C14.4917 6.21103 14.6668 7.0777 14.6668 7.99992C14.6668 8.92214 14.4917 9.78881 14.1415 10.5999C13.7917 11.411 13.3168 12.1166 12.7168 12.7166C12.1168 13.3166 11.4113 13.7915 10.6002 14.1413C9.78905 14.4915 8.92238 14.6666 8.00016 14.6666Z"
                                            fill="white"></path>
                                    </g>
                                </svg></span>
                        </div>
                    </div>
                    <div class="Exchange_exchange__header__row__QDAEe">
                        <h3>Получение:</h3>
                        <div class="Exchange_exchange__header__row__data__emKsz">
                            <div class="Circle_circle__3jS7D"
                                style="background: rgb(125, 224, 222); min-width: 9.6px; min-height: 9.6px; opacity: 1;">
                            </div>
                            <p>Любой банкомат</p><span data-tooltip-id="withdraw-methods-tooltip" data-tooltip-content="[0]"
                                class="sc-gXnjX iGlJQ"><svg width="16" height="16" viewBox="0 0 16 16" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <g opacity="0.4">
                                        <path
                                            d="M8.00016 11.3333C8.18905 11.3333 8.3475 11.2693 8.4755 11.1413C8.60305 11.0137 8.66683 10.8555 8.66683 10.6666V7.98325C8.66683 7.79436 8.60305 7.63881 8.4755 7.51658C8.3475 7.39436 8.18905 7.33325 8.00016 7.33325C7.81127 7.33325 7.65305 7.39703 7.5255 7.52458C7.3975 7.65258 7.3335 7.81103 7.3335 7.99992V10.6833C7.3335 10.8721 7.3975 11.0277 7.5255 11.1499C7.65305 11.2721 7.81127 11.3333 8.00016 11.3333ZM8.00016 5.99992C8.18905 5.99992 8.3475 5.93592 8.4755 5.80792C8.60305 5.68036 8.66683 5.52214 8.66683 5.33325C8.66683 5.14436 8.60305 4.98592 8.4755 4.85792C8.3475 4.73036 8.18905 4.66658 8.00016 4.66658C7.81127 4.66658 7.65305 4.73036 7.5255 4.85792C7.3975 4.98592 7.3335 5.14436 7.3335 5.33325C7.3335 5.52214 7.3975 5.68036 7.5255 5.80792C7.65305 5.93592 7.81127 5.99992 8.00016 5.99992ZM8.00016 14.6666C7.07794 14.6666 6.21127 14.4915 5.40016 14.1413C4.58905 13.7915 3.8835 13.3166 3.2835 12.7166C2.6835 12.1166 2.20861 11.411 1.85883 10.5999C1.50861 9.78881 1.3335 8.92214 1.3335 7.99992C1.3335 7.0777 1.50861 6.21103 1.85883 5.39992C2.20861 4.58881 2.6835 3.88325 3.2835 3.28325C3.8835 2.68325 4.58905 2.20814 5.40016 1.85792C6.21127 1.50814 7.07794 1.33325 8.00016 1.33325C8.92238 1.33325 9.78905 1.50814 10.6002 1.85792C11.4113 2.20814 12.1168 2.68325 12.7168 3.28325C13.3168 3.88325 13.7917 4.58881 14.1415 5.39992C14.4917 6.21103 14.6668 7.0777 14.6668 7.99992C14.6668 8.92214 14.4917 9.78881 14.1415 10.5999C13.7917 11.411 13.3168 12.1166 12.7168 12.7166C12.1168 13.3166 11.4113 13.7915 10.6002 14.1413C9.78905 14.4915 8.92238 14.6666 8.00016 14.6666Z"
                                            fill="white"></path>
                                    </g>
                                </svg></span>
                        </div>
                    </div>
                </div>
                <div class="Exchange_empty__4G-Zi"><img src="/offer_carousel.gif" width="149" height="138" alt="carousel">
                    <p>Мы разослали ваш запрос продавцам. Вскоре здесь появятся их предложения.</p>
                    <p>Мы обеспечиваем безопасность Вашей сделки. Комиссия сервиса 1%</p>
                </div>
            </div>
        </div>
    </div>
    <div class="status-container">
        <div class="sum-title">{{ loanData.sum }}</div>
        <div class="length-title">{{ loanData.term_days }}</div>
        <div class="get-title">{{ loanData.get_method }}</div>
        <div class="return-title">{{ loanData.return_method }}</div>
        <div v-if="status === 'Новый'">
            <div class="status-title">Ваш займ ожидает одобрения менеджером. Вам придет уведомление, когда это случится.
            </div>
            <button @click="cancelLoan">Отменить</button>
        </div>
        <div v-if="status === 'Выдан'">
            <div>Здесь инструкция о том как получить деньги выбранным способом</div>
            <button @click="recieveLoan">Я получил займ</button>
        </div>
        <div v-if="status === 'Получен'">
            <div class="return-sum">{{ return_sum }}</div>
            <div>Здесь инструкция о том как вернуть займ выбранным способом</div>
            <button @click="returnLoan">Вернуть займ</button>
        </div>
        <div v-if="status === 'На возврате'">
            <div class="status-title">Ваш возврат займа ожидает подтверждения менеджером. Вам придет уведомление, когда это
                случится.
        </div>
    </div>

</div>
<NavBar /></template>

<script>
import eventBus from '../eventBus'
import { ListLoader, InstagramLoader } from 'vue-content-loader'
import NavBar from '@/components/Navbar.vue';


export default {
    components: { InstagramLoader, NavBar },
    data() {
        return {
            infoActive: true,
            sexActive: true,
            loanData: {}
        }
    },
    watch: {
    },
    async beforeMount() {
        window.Telegram?.WebApp.MainButton.offClick(this.routeToBasket);
        window.Telegram?.WebApp.MainButton.hide();

        this.loanData = await this.getLoanData()
    },
    async mounted() {
        //this.updatePage(300);

    },
    async beforeUnmount() {
    },
    methods: {
        routeBack() {
            this.$router.go(-1)
        },
        changeStatus(status) {
            this.$store.state.myApi
                .put(this.$store.state.restAddr + '/loans', {
                    status,
                    user_id: this.$store.state.userId,
                },)
                .then(async (response) => {
                    if (status !== 'Получен') {
                        window.Telegram?.WebApp.disableClosingConfirmation()
                        return window.Telegram?.WebApp.close();
                    }
                    this.$store.state.profileData.active_loan_status = status
                    this.loanData = await this.getLoanData()

                })
                .catch(e => {
                    eventBus.$emit('noresponse', e);
                    this.isOrdering = false;
                })
        },
        async getLoanData() {
            const results = await this.$store.state.myApi.get(this.$store.state.restAddr + '/loans', {
                params: {
                    user_id: this.$store.state.userId,
                }
            })
                .then(response => {
                    return response.data;
                })
                .catch(e => { eventBus.$emit('noresponse', e) })

            return results ?? {}

        },
        cancelLoan() { this.changeStatus("Отменен") },
        recieveLoan() { this.changeStatus("Получен") },
        returnLoan() { this.changeStatus("На возврате") },
    }, computed: {
        status() { return this.$store.state.profileData?.active_loan_status }
    }
}
</script>
  

<style lang="scss" scoped>.hidden {
    display: none;
}

.row {
    display: flex;
    gap: 1rem;
    justify-content: space-between;
    position: relative;
    margin: 0 0 1.5625rem;

    &>div {
        width: 50%;
    }


}</style>
  