{
  "AGREE_TITLE": "Этот бот поможет вам с выбором ЖК для покупки квартиры.\nДоступна информация по новостройкам Москвы и Санкт-Петербурга, есть различные фильтры, а также полнотекстовый поиск.\n\nЕсли вы захотите обнулить результаты  и начать заново, достаточно отправить команду /start\n\nНо для начала мы должны попросить разрешение на обработку ваших <a href='http://clc.to/personal-data'>персональных данных</a>.",
  "AGREE_BUTTON": "Разрешаю",
  "QUESTION_1": "Будем благодарны за ответ на вопрос: \"Кто вы?\".  Обратная связь от пользователей помогает нам развивать и совершенствовать бота. \n\nЭтот раздел необязательный. Можно пропустить и сразу перейти к поиску.",
  "QUESTION_2": "",
  "WEBAPP_TITLE": "Перейдите в витрину ЖК, чтобы посмотреть актуальную информацию о новостройках.",
  "ABOUT_TITLE": "Витрина ЖК оформлена в веб-приложении (webapp). Возможные действия с витриной:\n\n1. Выбрать город (доступно две опции: Москва и Санкт-Петербург)\n\n2. Выбрать режим сортировки:\n\n2.1. Класс недвижимости (типовой, комфорт, бизнес, элитный)\n2.2. Год ввода в эксплуатацию (2023, 2024, 2025, 2026+), \n2.3. Цена за м2, \n2.4. Распроданность квартир в %%\n\nПосле выбора режима сортировки будет доступен полнотекстовый поиск.  \n\n3. После выбора объекта посмотрите рендеры, а также, для некоторых ЖК, фото хода строительства. \n\n4. Кроме этого, будет доступна информация по ЖК:\n\n📍 Адрес\n🚇 Метро\n📒 Проектная декларация\n🗓 Ввод в эксплуатацию\n🔑 Выдача ключей\n💵 Средняя цена за 1 м²\n📈 Распроданность квартир\n🏢 Этажей\n🎨 Тип отделки\n\n5. Нажмите кнопку \"Узнать больше\", и скачайте проектную декларацию ЖК. Проектная декларация содержит подробную информацию об опыте и финансовом положении застройщика, о параметрах реализуемого проекта, включая типы домов и инфраструктуру.\n\n6. Оставьте контактную информацию для обратной связи, и получите персональную консультацию и предзаказ подарка: закрытой аналитики по выбранному ЖК.",
  "ABOUT_BUTTON": "О проекте",
  "WEBAPP_BUTTON": "🟢 Витрина ЖК",
  "*": "*",
  "BUTTON_BACK_ADMIN": "Администрирование",
  "CHOOSE_ACTION": "Выберите действие",
  "SEND_FILE": "Отправьте excel файл, содержащий данные о ЖК",
  "⚙️": "⚙️",
  "IMPORT_SUCCESS": "Импорт прошел успешно",
  "ANSWER_1_1": "Планирую купить квартиру в ближайшие 1-3 месяца",
  "ANSWER_1_2": "Планирую купить квартиру в течение года",
  "ANSWER_1_3": "Я риелтор",
  "ANSWER_1_4": "Я представитель застройщика",
  "ANSWER_1_5": "Другое",
  "ANSWER_SKIP": "Перейти к поиску ЖК",
  "ENTER_RIGHT_COMMAND": "Чтобы увидеть список доступных команд, напишите в этот чат «/».",
  "ADMIN_MENU_BUTTON": "Администрирование",
  "BUTTON_IMPORT": "Импорт Excel",
  "BUTTON_ADMINS": "Администраторы",
  "BUTTON_CLIENT_MENU": "В пользовательское меню",
  "BACK_CLIENT_TITLE": "Пользовательское меню",
  "CHOOSE_ADMIN": "Текущие администраторы:\n\n*",
  "BUTTON_ADD_ADMIN": "Добавить",
  "BUTTON_DELETE_ADMIN": "Удалить",
  "SEND_NEW_ID": "Отправьте uid или username человека, чтобы сделать его администратором",
  "BUTTON_CONFIRM": "Подтвердить",
  "BUTTON_CANCEL": "Отменить",
  "ADD_AS_SUPERADMIN": "Добавить как суперадмина?",
  "CONFIRM_ADDING": "Подтвердите добавление",
  "SELECT_ADMIN_TO_DELETE": "Выберите администратора, которого хотите удалить",
  "CONFIRM_DELETE": "Подтвердить",
  "DB_ERROR": "Ошибка базы",
  "ITEM_INFO_TITLE": "Итак, вы выбрали ЖК, который вас интересует. Отлично!\n\nНа данном этапе вы можете:\n\n1. Указать свой номер телефона, чтобы наш менеджер ответил на все вопросы и рассказал о действующих акциях и скидках, сделал  индивидуальную подборку объектов.\n\n2.  Скачать проектную декларацию выбранного вами ЖК. \n\nПроектная декларация содержит подробную информацию о застройщике, его опыте и финансовом положении, о параметрах реализуемого проекта, включая типы индивидуальных домов и инфраструктурное обеспечение.\n\n3. Сделать предзаказ подарка\n\nВ ближайшее время мы получим доступ к закрытой аналитике от сервиса <a href=\"http://%D0%BF%D1%80%D0%BE%D0%B4%D0%BE%D0%BC%D0%B0.%D0%B4%D0%BE%D0%BC.%D1%80%D1%84\">продома.дом.рф</a>. На данный момент доступна презентация аналитического отчета (динамика продаж, информация о ходе строительства и пр.)\n\nЧтобы скачать презентацию отчета и бесплатно получить такой отчет по выбранному ЖК, оставьте контакт для связи. Презентацию вышлем прямо сейчас.",
  "IMPORT_ERROR": "IMPORT_ERROR",
  "USE_CURRENT_PHONE": "Можно связаться с вами по этому номеру: *",
  "SEND_PHONE": "Нажмите на кнопку ниже, чтобы оставить номер телефона.\n\nИли просто напишите номер.",
  "APPOINTMENT_SENT": "Спасибо! Наши менеджеры свяжутся с вами в ближайшее время.",
  "NEW_APPOINTMENT": "Новая заявка на консультацию по объекту №*: *\n\nНомер: *"
}